Revit 2027 API
BuiltInFailures.GeometryFailures.ConvertFaceRegionsToFacesFailed Property
 Failed to replace an instance face with its face regions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConvertFaceRegionsToFacesFailed { get; }
Public Shared ReadOnly Property ConvertFaceRegionsToFacesFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConvertFaceRegionsToFacesFailed {
	FailureDefinitionId^ get ();
}
static member ConvertFaceRegionsToFacesFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace